blog-posts/2004-11-30-notable-people-who-use-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Notable people who use Emacs</title>
<!-- 2014-04-30 Wed 17:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Notable people who use Emacs</h1>
<p>
November 30th, 2004 -
<a href="http://sachachua.com/blog/p/2448"><a href="http://sachachua.com/blog/p/2448">http://sachachua.com/blog/p/2448</a></a>
</p>

<p>
Shamelessly stolen off comp.emacs. You can see it at
</p>

<p>
<a href="http://groups.google.com/groups?hl=en&lr=&frame=right&th=636e3d0f9a421166&seekm=87y8hn66rk.fsf@heresy.ainola.jyu.fi#link1"><a href="http://groups.google.com/groups?hl=en&lr=&frame=right&th=636e3d0f9a421166&seekm=87y8hn66rk.fsf@heresy.ainola.jyu.fi#link1">http://groups.google.com/groups?hl=en&lr=&frame=right&th=636e3d0f9a421166&seekm=87y8hn66rk.fsf@heresy.ainola.jyu.fi#link1</a></a>
</p>

<ul class="org-ul">
<li>Richard Stallman (founder of Free Software Foundation) is an Emacs
user. Hint: He is the original author of Emacs, after all. :-)
</li>

<li>Yukihiro Matsumoto (creator of the Ruby programming language) is an
Emacs user. Hint: He said so in a post to ruby-talk mailing list.
Quote from
</li>
</ul>
<p>
<a href="http://blade.nagaokaut.ac.jp/cgi-bin/scat.rb/ruby/ruby-talk/108051"><a href="http://blade.nagaokaut.ac.jp/cgi-bin/scat.rb/ruby/ruby-talk/108051">http://blade.nagaokaut.ac.jp/cgi-bin/scat.rb/ruby/ruby-talk/108051</a></a>:
 “I wrote ruby-mode.el; I live in Emacs; I program in Emacs; I debug in
 Emacs; I read mails in Emacs; I wrote MUA for Emacs.”
</p>

<ul class="org-ul">
<li>Jeremy Zawodny (author of “High Performance MySQL”) is an Emacs
user. Hint: He wrote Emacs Beginners' Howto
</li>
</ul>

<p>
(<a href="http://jeremy.zawodny.com/emacs/"><a href="http://jeremy.zawodny.com/emacs/">http://jeremy.zawodny.com/emacs/</a></a>).
</p>

<ul class="org-ul">
<li>Andrew S. Tanenbaum used elle. It is some clone of emacs. Then
</li>
</ul>

<blockquote>
<p>
he moved to emacs. He said so in his homepage.
</p>

<p>
<a href="http://www.cs.vu.nl/~ast/home/faq.html"><a href="http://www.cs.vu.nl/~ast/home/faq.html">http://www.cs.vu.nl/~ast/home/faq.html</a></a>
“Which editor do you use
 for producing books? I used to use elle, a stripped down emacs
 clone, but I finally decided to take the plunge and move up to
 full emacs.”
</p>
</blockquote>

<ul class="org-ul">
<li>James Gosling, father of Java, currently CTO at Sun's Developer
Products Group, uses Emacs. Hint: He wrote a C-based Emacs
implementation in 1981 (the code portions of which became GNU
Emacs). &#x2026; Uh, no. He was one of the reasons that the GPL and
copyright assignments were invented. His code had to be removed
from Emacs and substantial portions rewritten by Stallman,
because he refused to let his stuff get distributed by the FSF.
</li>

<li>Jamie Zawinski, one of the main coders for Netscape Navigator
and one the founders of the Mozilla Foundation, uses Emacs. Hint:
He wrote Lucid Emacs. There's an Emacs timeline document on his
website, <a href="http://www.jwz.org/"><a href="http://www.jwz.org/">http://www.jwz.org/</a></a> &#x2026; So you can
</li>
</ul>
<p>
bet your sweet <b>*</b>
 that he is not using Emacs, but rather XEmacs (which is the
 successor of Lucid Emacs).
</p>

<ul class="org-ul">
<li>Guy Steele. Co-inventor of Scheme, author of “Common Lisp the
</li>
</ul>

<blockquote>
<p>
Language”, co-author of the Java language specification, first
 person to port TeX, served on the standards commitees for C,
 Fortran, Common Lisp and Scheme. And finally designer of the
 original Emacs command set.
</p>
</blockquote>

<ul class="org-ul">
<li>John McCarthy. Inventor of Lisp, one of the founders of AI
</li>
</ul>

<blockquote>
<p>
research. (proof:
<a href="http://www-formal.stanford.edu/jmc/facts.txt"><a href="http://www-formal.stanford.edu/jmc/facts.txt">http://www-formal.stanford.edu/jmc/facts.txt</a></a>).
</p>
</blockquote>

<ul class="org-ul">
<li>SF writer Neil Stephenson uses Emacs for some of his books
</li>
</ul>

<blockquote>
<p>
<a href="http://www.cryptonomicon.com/beginning.html"><a href="http://www.cryptonomicon.com/beginning.html">http://www.cryptonomicon.com/beginning.html</a></a>
“I use emacs, which
 might be thought of as a thermonuclear word processor.”
</p>
</blockquote>

<ul class="org-ul">
<li>Donald Erwin Knuth (creator of TeX) is an Emacs user. Hint:
</li>
</ul>

<blockquote>
<p>
<a href="http://www-cs-faculty.stanford.edu/~knuth/programs.html"><a href="http://www-cs-faculty.stanford.edu/~knuth/programs.html">http://www-cs-faculty.stanford.edu/~knuth/programs.html</a></a>
See that
 Fvwm2-config and its screenshot.
</p>
</blockquote>

<ul class="org-ul">
<li>Eric “ESR” Steven Raymond is an Emacs user. Hints: Author of “Learning
</li>
</ul>

<blockquote>
<p>
GNU Emacs”. See also this:
<a href="http://www.catb.org/~esr/fvwm2/"><a href="http://www.catb.org/~esr/fvwm2/">http://www.catb.org/~esr/fvwm2/</a></a>
</p>
</blockquote>

<p>
Notable people who don't use Emacs
</p>

<ul class="org-ul">
<li>Larry Wall (creator of Perl) is NOT an Emacs user. Hint: His geek
code for Emacs
</li>
</ul>
<p>
(<a href="http://www.wall.org/~larry/ungeek.html"><a href="http://www.wall.org/~larry/ungeek.html">http://www.wall.org/~larry/ungeek.html</a></a>)
decodes as: “I
 refuse to categorize myself on Emacs. Emacs? I don't even know what
 that is&#x2026;”
</p>

<ul class="org-ul">
<li>Tim O'Reilly is NOT emacs user. He uses vi:
</li>
</ul>

<blockquote>
<p>
<a href="http://www.oreilly.com/pub/a/oreilly/ask_tim/1999/unix_editor.html"><a href="http://www.oreilly.com/pub/a/oreilly/ask\_tim/1999/unix\_editor.html">http://www.oreilly.com/pub/a/oreilly/ask\_tim/1999/unix\_editor.html</a></a>
</p>
</blockquote>

<ul class="org-ul">
<li>W. Richard Stevens (RIP) was NOT Emacs user. He used vi. Hints:
</li>
</ul>

<blockquote>
<p>
<a href="http://www.kohala.com/"><a href="http://www.kohala.com/">http://www.kohala.com/</a></a>
 <a href="http://www.kohala.com/start/"><a href="http://www.kohala.com/start/">http://www.kohala.com/start/</a></a>
</p>
</blockquote>

<ul class="org-ul">
<li>Paul Graham, author of several Lisp books, designer of Arc, founder
of Viaweb (which became Yahoo! Store), ironically uses vi and NOT
Emacs according to
</li>
</ul>
<p>
<a href="http://developers.slashdot.org/comments.pl?sid=117761&cid=9966507"><a href="http://developers.slashdot.org/comments.pl?sid=117761&cid=9966507">http://developers.slashdot.org/comments.pl?sid=117761&cid=9966507</a></a>
. More proofs needed.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
